print('Введите координату точки x')
x = float(input())
print('Введите координату точки y')
y = float(input())
if (x > 0) and (y > 0):
    print('Точка находится в 1-й координатной четверти')
elif (x < 0) and (y > 0):
    print('Точка находится во 2-й координатной четверти')
elif (x < 0) and (y < 0):
    print('Точка находится в 3-й координатной четверти')
elif (x > 0) and (y < 0):
    print('Точка находится в 4-й координатной четверти')
elif (x > 0) and (y == 0):
    print('Точка находится на границе между 1 и 4 четвертями')
elif (x < 0) and (y == 0):
    print('Точка находится на границе между 2 и 3 четвертями')
elif (x == 0) and (y > 0):
    print('Точка находится на границе между 1 и 2 четвертями')
elif (x == 0) and (y < 0):
    print('Точка находится на границе между 3 и 4 четвертями')
else:
    print('Точка принадлежит всем четвертям')

